/**
 * @file film-data 相关 kelvin 文件
 * @description 开尔文时间线系列
 */

import { DataType } from '.'

export const data: DataType = {
  eleven: {
    cnName: '星际迷航',
    enName: 'Star Trek',
    time: '2009 年 5 月 8 日',
    productCompany: '派拉蒙影业公司 / 坏机器人',
    issueCompany: '派拉蒙影业公司',
    director: '杰弗里 · 雅各布 · 艾布拉姆斯',
    scriptwriter: '罗贝特 · 奥兹 / 艾利克斯 · 库茨曼',
    type: '科幻 / 动作 / 冒险',
    stars: '克里斯 · 派恩，扎克瑞 · 昆图，佐伊 · 索尔达娜，卡尔 · 厄本，艾瑞克 · 巴纳',
    duration: '127 分钟',
    mainPrize: '第 82 届奥斯卡金像奖最佳化妆，第 36 届美国电影电视土星奖最佳化妆',
    cost: '1.4 亿美元',
    boxOffice: '3.86 亿美元',
    introduction: '未知的时空，无边的黑洞，一艘巨型罗慕兰战舰突然出现在太空中。崇武暴躁的罗慕兰人，是多年前离开瓦肯星人自建星际帝国的战士种族。如今，罗慕兰帝国的统治者尼诺，为了解决日后的强大劲敌史波克，正跨越星际和时空四处搜寻他的下落。而一名为凯尔文号的联邦星舰，在追捕中不幸落入了罗慕兰的魔掌。还尚稚嫩的联邦星舰，在罗慕兰战舰催枯拉朽的火力面前反击，无异以卵击石。幸而临危受命的舰长乔治 · 柯克英勇机智，在星舰被摧毁前的短短十二分钟之内，带领全船八百余人逃出生天，这其中包括他正在分娩的妻子'
  },
  twelve: {
    cnName: '星际迷航 2：暗黑无界',
    enName: 'Star Trek II: Into Darkness',
    time: '2013 年 5 月 16 日',
    productCompany: '派拉蒙影业公司 / 坏机器人 / 天空之舞制片公司',
    issueCompany: '派拉蒙影业公司',
    director: 'J · J · 艾布拉姆斯',
    scriptwriter: '艾里克斯 · 库兹曼',
    type: '动作 / 科幻 / 冒险',
    stars: '克里斯 · 派恩，扎克瑞 · 昆图，佐伊 · 索尔达娜，本尼迪克特 · 康伯巴奇，卡尔 · 厄本，西蒙 · 佩吉，约翰 · 赵，安东 · 尤金',
    duration: '129 分钟',
    mainPrize: '第 86 届奥斯卡金像奖最佳视觉效果（提名）',
    cost: '',
    boxOffice: '4.67 亿美元',
    introduction: '企业号虽被调召回到 23 世纪的地球，但他们却发现，一股无法阻挡的恐怖力量，不仅从内部摧残星际联邦，更让世界濒临毁灭。企业号舰长詹姆士柯克将领军对抗战火连天的世界，并且想方设法缉捕聪明绝顶，而前所未见的神秘星际恐怖份子约翰哈里森'
  },
  thirteen: {
    cnName: '星际迷航 3：超越星辰',
    enName: 'Star Trek III: Beyond',
    time: '2016 年 7 月 22 日（美国）、2016 年 9 月 2 日（中国大陆）',
    productCompany: '派拉蒙影业公司',
    issueCompany: '派拉蒙影业公司',
    director: '林诣彬',
    scriptwriter: '吉恩 · 罗登贝瑞，西蒙 · 佩吉，罗伯托 · 奥奇',
    type: '动作 / 科幻 / 惊悚 / 冒险',
    stars: '约翰 · 赵，西蒙 · 佩吉，克里斯 · 派恩，扎克瑞 · 昆图，佐伊 · 索尔达娜，卡尔 · 厄本，安东 · 尤金，伊德瑞斯 · 艾尔巴，索菲亚 · 宝特拉，索瑞 · 安达斯鲁',
    duration: '120 分钟',
    mainPrize: '第 89 届奥斯卡金像奖最佳化妆与造型（提名）',
    cost: '1.85 亿美元',
    boxOffice: '截止至 2016 年 7 月 24 日，全球累计票房 8960 万美元。截止至 2016 年 7 月 31 日全球累计票房 1.65 亿美元。截至 2016 年 8 月 7 日全球累计票房 1.94 亿美元。该片于 2016 年 9 月 2 日（周五）在中国大陆上映，首周上映三天累计票房 2.05 亿人民币',
    introduction: '柯克船长带领企业号继续踏上宇宙探索的旅程，他向老骨头讲述了自己对于船长身份的忧虑，而在他与最好的朋友史波克互诉衷肠前，他们又接到了一个紧急救援的任务。而神秘敌人剋劳开始攻击企业号，而幸存的企业号成员也分散至一个行星上求生。老骨头、史波克、柯克、契诃夫、乌胡拉、苏鲁等船员再次团结起来，为生存作战。但在斯科特遇见了婕拉之后，他们找到了能够征集所有船员并且逃离那座星球的方法。需要在卡尔毁掉星际舰队之前成功阻止他'
  }
}
