/**
 * @file crew-data 相关 kelvin 文件
 * @description 开尔文时间线系列演员信息
 */

import IconChrisPine from './images/kelvin/icon-chris-pine.jpg'
import IconZacharyQuinto from './images/kelvin/icon-zachary-quinto.jpg'
import IconKarlUrban from './images/kelvin/icon-karl-urban.jpg'
import IconSimonPegg from './images/kelvin/icon-simon-pegg.jpg'
import IconJohnCho from './images/kelvin/icon-john-cho.jpg'

import { DataType } from '.'

export const data: DataType = {
  ChrisPine: {
    icon: IconChrisPine,
    zhName: '克里斯 · 派恩',
    enName: [
      'Chris Pine'
    ],
    alias: [
      'Christopher Whitelaw Pine'
    ],
    nationality: '美国',
    national: '',
    birthPlace: '美国加利福尼亚州洛杉矶',
    birthDay: '1980 年 8 月 26 日',
    deathTime: '',
    constellation: '处女座',
    height: '183cm',
    graduateSchool: '加州大学伯克利分校',
    profession: [
      '演员'
    ],
    representativeWorks: [
      '星际迷航开尔文时间线系列',
      '《公主日记 2：皇室婚约》',
      '《危情时速》',
      '《赴汤蹈火》',
      '《神奇女侠》'
    ],
    mainAchievements: [
      '青少年选择奖第 19 届最佳动作电影男演员',
      '很可惜其他均为提名'
    ],
    hobby: [],
    information: [
      '克里斯 · 派恩（Chris Pine），1980 年 8 月 26 日出生于美国加利福尼亚州洛杉矶，美国影视演员，毕业于加州大学伯克利分校并获得英语文学学士学位',
      '克里斯 · 派恩的家人（父亲、母亲、外祖母、外祖父以及姐姐）都是从事演艺事业，因此他从小就立志当一名演员，他的父母当然是不遗余力地给予支持。派恩毕业于加州柏克莱大学，又到美国音乐学院以及英国利兹大学学习表演',
      '克里斯 · 派恩的演艺生涯开始于剧场表演。他在威廉姆斯的戏剧节（Williamstown Theater Festival），加利福尼亚大学和洛杉矶的剧团里担当过表演',
      '2003 年，他初登荧幕，客串《急诊室的故事》。2004 年，24 岁的克里斯 · 佩恩出演了《公主日记 2：皇室婚约》。2010 年，克里斯 · 派恩在《危情时速》中担任主演',
      '2009 年，克里斯 · 派恩因饰演《星际迷航》电影中的詹姆斯 · T · 柯克舰长一角走红。2013 年，克里斯 · 派恩主演的《星际迷航：暗黑无界》上映，并获得第 15 届青少年选择奖最佳夏日电影男星的提名',
      '2016 年，主演的《星际迷航：超越星辰》、《赴汤蹈火》上映。2017 年，主演的 DC 电影《神奇女侠》上映',
      '2017 年，确定与米歇尔 · 威廉姆斯合作出演惊悚片《All the Old Knives》',
      '2018 年 3 月 9 日，与奥普拉 · 温弗瑞、瑞茜 · 威瑟斯彭、敏迪 · 卡灵合作出演的奇幻电影《时间的皱折》在美国上映。2018 年 9 月 6 日，主演的历史电影《法外之王》在多伦多国际电影节上映，饰演苏格兰国王罗伯特 · 布鲁斯',
      '2019 年，与英迪娅 · 埃斯利合作出演的电视迷你剧《我即黑夜》播出',
      '2020 年，与盖尔 · 加朵合作出演的电影《神奇女侠 1984》在美国上映'
    ],
    evaluation: [
      '克里斯 · 派恩被称为为马特 · 达蒙和布拉德 · 皮特综合体的大男孩，从骨子里就散发着一股浓郁的美国派味儿',
      '克里斯饰演的詹姆斯 · T · 柯克舰长在《星际迷航》中算是一个大胆的尝试'
    ]
  },
  ZacharyQuinto: {
    icon: IconZacharyQuinto,
    zhName: '扎克瑞 · 昆图',
    enName: [
      'Zachary Quinto',
      'Zachary John Quinto'
    ],
    alias: [],
    nationality: '美国',
    national: '',
    birthPlace: '美国宾夕法尼亚州匹兹堡',
    birthDay: '1977 年 6 月 2 日',
    deathTime: '',
    constellation: '双子座',
    height: '193cm',
    graduateSchool: '卡耐基梅隆大学',
    profession: [
      '演员'
    ],
    representativeWorks: [
      '星际迷航开尔文时间线系列',
      '《终局》',
      '莎翁名剧《无事生非》',
      '《Stone》',
      '《彭赞斯的海盗》'
    ],
    mainAchievements: [
      '很可惜艾美奖、土星奖、人民选择奖以及青少年选择奖均为提名'
    ],
    hobby: [],
    information: [
      '扎克瑞 · 昆图（Zachary Quinto），1977 年 6 月 2 日出生于美国宾夕法尼亚州匹兹堡，毕业于卡耐基梅隆大学的戏剧学院，美国影视演员',
      '在《24 小时》第三季中，扎克瑞 · 昆图扮演了 CTU 分析家亚当 · 考夫门，还在《英雄》中出演复杂的邪恶人物塞拉。2008 年，他确认出演《星际迷航》电影系列新作，并两度登上了《娱乐周刊》的封面。2010 年，扎克瑞 · 昆图在外百老汇剧《天使在美国》担任主演。2011 年 10 月，扎克瑞 · 昆图正式宣布出柜。2013 年 5 月 17 日，他主演的《星际迷航：暗黑无界》在美国上映。7 月，他因出演《美国恐怖故事》而获得第 65 届艾美奖最佳迷你剧 / 电影电视男配提名',
      '扎克瑞 · 昆图出生在美国宾西法尼亚州匹兹堡的天主教家庭，有一半意大利血统、一半爱尔兰血统。7 岁，失去父亲；11 岁开始，就已经是童星',
      '2011 年 10 月，扎克瑞 · 昆图在接受杂志访问时公开性取向，正式出柜'
    ],
    evaluation: [
      '他因为在电影版《星际迷航》中饰演企业号大副斯波克而为影迷们所知',
      '扎克瑞 · 昆图自身性格中拥有学院派的浓重气息，有他自己严肃而又不可思议的幽默感，这样的混合很好的诠释了史波克角色复杂的欺骗性'
    ]
  },
  KarlUrban: {
    icon: IconKarlUrban,
    zhName: '卡尔 · 厄本',
    enName: [
      'Karl Urban'
    ],
    alias: [
      'Karl-Heinz Urban'
    ],
    nationality: '新西兰',
    national: '',
    birthPlace: '新西兰惠灵顿',
    birthDay: '1972 年 6 月 7 日',
    deathTime: '',
    constellation: '双子座',
    height: '185cm',
    graduateSchool: '',
    profession: [
      '演员'
    ],
    representativeWorks: [
      '星际迷航开尔文时间线系列',
      '《谍影重重 2》',
      '《雷神 3》'
    ],
    mainAchievements: [],
    hobby: [],
    information: [
      '卡尔 · 厄本（Karl Urban），1972 年 6 月 7 日出生于新西兰惠灵顿，新西兰影视演员',
      '1992 年，因参演个人第一部电视系列剧《肖特兰街》，在演艺圈出道',
      '1998 年，出演个人首部电影《欢迎光临天堂酒吧》',
      '从 2002 年开始，在《魔戒三部曲》后半部分，均饰演伊欧墨（Éomer）',
      '2004 年，出演电影《谍影重重 2》',
      '从 2009 年开始，在《星际迷航》系列片中，均饰演配角麦考伊医生',
      '2012 年，主演电影《特警判官》',
      '2017 年，与克里斯 · 海姆斯沃斯等人出演电影《雷神 3：诸神黄昏》',
      '2019 年，开始在 Amazon 反英雄漫改美剧《黑袍纠察队》中饰演 Billy Butcher 一角'
    ],
    evaluation: []
  },
  SimonPegg: {
    icon: IconSimonPegg,
    zhName: '西蒙 · 佩吉',
    enName: [
      'Simon Pegg'
    ],
    alias: [
      'Dr. Russel Fell',
      'The Fresh Pegg'
    ],
    nationality: '英国',
    national: '',
    birthPlace: '英国格洛斯特',
    birthDay: '1970 年 2 月 14 日',
    deathTime: '',
    constellation: '水瓶座',
    height: '178cm',
    graduateSchool: '布里斯托尔大学',
    profession: [
      '演员',
      '编剧',
      '导演',
      '制片人'
    ],
    representativeWorks: [
      '星际迷航开尔文时间线系列',
      '碟中谍系列',
      '《屋事生非第一季》',
      '《僵尸肖恩》',
      '《微不足道》',
      '《热血警探》',
      '《保罗》',
      '《世界尽头》'
    ],
    mainAchievements: [
      '第 40 届土星奖最佳男主角奖（提名）',
      '第 40 届土星奖最佳编剧奖（提名）',
      '第 19 届美国评论家选择电影奖喜剧片最佳男主角奖（提名）',
      '第 55 届英国电视学院奖最佳情景喜剧奖（提名）'
    ],
    hobby: [],
    information: [
      '1970 年 2 月 14 日，西蒙 · 佩吉出生于英国格洛斯特的一个中产家庭。1977 年，7 岁的时候遭遇父母离异',
      '1985 年，15 岁时，西蒙 · 佩吉因父亲生意破产而离开学校在一家餐馆打工了六年',
      '1993 年，佩吉搬到伦敦。此后，他就开始了自己的单口喜剧巡演',
      '1996 年，参演个人首部电视剧《精神病院》',
      '1998 年，开始经常出现在英国广播公司 4 频道的节目《The 99p Challenge》中',
      '1999 年，出演由埃德加 · 赖特执导的电视剧《屋事生非第一季》，并担任该剧的编剧，他凭借该剧提名英国喜剧奖最佳喜剧新人奖',
      '2001 年，由其主演的电视剧《屋事生非第二季》首播。同年，由其参演的电视剧《兄弟连》播出',
      '2002 年，出演纪录片《危险！5 万伏电压！》，他在片中饰演生存能力极发达国际组织"死灵人"的一员拉塞尔 · 菲尔',
      '2004 年 4 月，与尼克 · 弗罗斯特合作主演的恐怖喜剧电影《僵尸肖恩》上映，他在片中饰演在伦敦的电器行工作的平凡男子肖恩。同年，与迪兰 · 莫兰、比尔 · 贝利联袂出演的电视剧《布莱克书店第三季》播出',
      '2005 年，参演由史蒂夫 · 班德莱克执导的恐怖喜剧电影《绅士的启示联盟》',
      '2006 年，与汤姆 · 克鲁斯、菲利普 · 塞默 · 霍夫曼联袂主演动作惊悚电影《碟中谍 3》。同年，与大卫 · 休默共同主演犯罪电影《微不足道》',
      '2007 年 2 月 14 日，与尼克 · 弗罗斯特合作主演的动作电影《热血警探》上映，他在片中饰演被调到山德福德乡村的伦敦警察尼古拉斯 · 安吉',
      '2008 年，与克尔斯滕 · 邓斯特、梅根 · 福克斯联袂主演的爱情喜剧电影《如何众叛亲离》上映，他在片中饰演性格古怪到令人无法容忍的西德尼 · 扬',
      '2009 年，在科幻动作电影《星舰迷航》中饰演机长史考特',
      '2010 年，出版自传《Nerd Do Well》。同年 10 月，与安迪 · 瑟金斯、艾拉 · 菲舍尔联袂主演的惊悚剧《布克和海尔》首播',
      '2011 年，与尼克 · 弗罗斯特共同主演的科幻冒险电影《保罗》上映，他在片中饰演科幻狂热粉丝格雷姆 · 威利。同年 11 月 15 日，与尼克 · 弗罗斯特等参与配音的动画电影《丁丁历险记：独角兽号的秘密》上映，配音的角色为自命不凡、愚蠢透顶、笨手笨脚的警探杜邦',
      '2012 年 1 月 28 日，与汤姆 · 克鲁斯、杰瑞米 · 雷纳等联合主演的电影《碟中谍 4》上映，他在片中饰演团队中的技术专家班吉。同年 7 月 27 日，参与配音的动画电影《冰川时代 4》上映',
      '2013 年 5 月 16 日，由其出演的电影《星际迷航：暗黑无界》上映。同年 7 月 19 日，与尼克 · 弗罗斯特共同主演的科幻动作电影《世界尽头》上映，他在片中饰演青少年时期就深坠烟海的老家伙盖瑞 · 金，凭借该片入围第 40 届土星奖最佳男主角奖、第 19 届美国评论家选择电影奖喜剧片最佳男主角奖。同年，由其参演的犯罪剧《洛城黑帮》播出',
      '2014 年 8 月 14 日，由其主演的冒险喜剧电影《寻找幸福的赫克托》上映，他在片中饰演每天正常作息上下班，倾听病人的心事的心理医生赫克托',
      '2015 年 4 月 10 日，与沙利文 · 斯特普尔顿、泰莉莎 · 帕尔墨联袂主演的动作惊悚电影《杀了我三次》上映，他在片中饰演职业杀手查理。同年，与约翰 · 赵等联合主演科幻电影《星际迷航 3：超越星辰》，在片中饰演企业号总工程师斯考特。同年 5 月 29 日，与蕾克 · 贝尔合作主演的爱情喜剧电影《爷们些》上映，他在片中饰演与南希约会的陌生男子杰克。同年 7 月 31 日，由其出演的电影《碟中谍 5：神秘国度》上映。同年 8 月 14 日，与凯特 · 贝金赛尔、罗宾 · 威廉姆斯联袂主演的科幻喜剧电影《魔法老师》上映，他在片中饰演一个工作不得志、爱情不如意单身中学老师尼尔。同年 8 月 23 日，与雷 · 罗马诺、丹尼斯 · 利瑞参与配音的动画电影《冰川时代 5：星际碰撞》上映，配音的角色为体型瘦小的独眼黄鼠狼巴克',
      '2017 年，与亚历珊德拉 · 达达里奥、朱诺 · 坦普尔联袂主演剧情电影《传输失败》',
      '2018 年 3 月 30 日，与泰伊 · 谢里丹、奥利维亚 · 库克联合出演的科幻冒险电影《头号玩家》上映。同年 5 月，与玛格特 · 罗比共同主演的惊悚电影《终端》上映。同年 7 月 27 日，由其出演的电影《碟中谍 6：全面瓦解》上映。同年 10 月 31 日，与阿沙 · 巴特菲尔德等共同主演的动作喜剧电影《屠宰场规则》上映，他在片中饰演屠宰场学校教师梅雷迪思 · 豪斯曼',
      '2019 年 7 月 26 日，由其出演的科幻动作剧《黑袍纠察队第一季》首播。同年 8 月，参与配音的动画片《魔水晶：抗争时代》播出',
      '2020 年，出演由克里斯托夫 · 迈考利执导的电影《碟中谍 7》。同年 4 月，与莉莉 · 柯林斯、康妮 · 尼尔森联合主演的惊悚电影《继承》上映。同年 10 月 30 日，与尼克 · 弗罗斯特共同主演的电视剧《真相探寻者》首播。同年，与伽塔 · 马塔拉佐共同参与配音的家庭冒险动画电影《驼峰》上映',
      '2021 年 1 月 4 日，与麦克 · 辛、大卫 · 田纳特联合出演的电视剧《舞台剧第二季》首播'
    ],
    evaluation: [
      '西蒙 · 佩吉是才华出众而又画风多变的编剧、演员和制片人，他一向负责搞笑、搞怪，擅长给角色带来幽默或严肃的表演。在电影《僵尸肖恩》中，他有着出色的剧本和出色的表演。在电影《魔法老师》中，西蒙 · 佩吉通过其精湛的演技和浑然天成的喜剧本色，将影片中尼尔的"懒"演绎得淋漓尽致，生动再现了一个平凡小人物希望对现实进行修整，让"生活变得更美好"的朴实心愿。在动画电影《冰川时代 5：星际碰撞》中，巴克在他的诠释下显得更立体生动'
    ]
  },
  JohnCho: {
    icon: IconJohnCho,
    zhName: '约翰 · 赵',
    enName: [
      'John Cho'
    ],
    alias: [
      '조요한'
    ],
    nationality: '美国',
    national: '',
    birthPlace: '韩国首尔',
    birthDay: '1972 年 6 月 16 日',
    deathTime: '',
    constellation: '双子座',
    height: '178cm',
    graduateSchool: '加州大学伯克利分校',
    profession: [
      '演员'
    ],
    representativeWorks: [
      '星际迷航开尔文时间线系列',
      '《网络谜踪》',
      '《寻堡奇遇》',
      '《全面回忆》',
      '《美国派》',
      '《未来闪影》'
    ],
    mainAchievements: [
      '第 14 届 MTV 电影奖最佳歌舞场面奖（提名）',
      '第 14 届 MTV 电影奖最佳银幕搭档奖（提名）',
      '第 7 届青少年选择奖最佳摇滚明星电影瞬间（提名）',
      '第 34 届独立精神奖最佳男主角奖（提名）'
    ],
    hobby: [],
    information: [
      '约翰 · 赵（John Cho、조요한），1972 年 6 月 16 日出生于韩国首尔，祖籍中国香港，美籍韩裔影视男演员，毕业于加州大学伯克利分校',
      '6 岁时随家人移民美国，并在洛杉矶定所。小时候，约翰 · 赵在电视上看到了演员乔治 · 竹井出演的电视剧《星际迷航》，由于对方扮演的是一个英雄角色，加上他们都是亚裔的缘故，因此他受到了鼓舞和很大的影响',
      '约翰 · 赵在加州大学伯克利分校取得英语学位后，回到南加州教了一阵子英文。而在成为演员之前，他还组过一支名为 Left of Zed 的乐队，并担任了主唱',
      '约翰 · 赵的父亲是一位牧师。他的妻子是美国女演员凯丽 · 希古奇（Kerri Higuchi），二人育有一个儿子',
      '1997 年，出演个人首部电影《人海奇花》，从而正式进入演艺圈',
      '1999 年，参演爱情喜剧电影《美国派》',
      '2001 年，其主演的剧情电影《庭院里的女人》在中国内地上映',
      '2004 年，其主演的喜剧电影《寻堡奇遇》上映，他与卡尔 · 潘凭借该片入围了第 14 届 MTV 电影奖最佳歌舞场面奖、最佳银幕搭档奖',
      '2007 年，其主演的犯罪电影《西 32 大街》在美国上映',
      '2009 年，在科幻冒险电影《星际迷航》中饰演苏鲁，从而受到关注。同年，其主演的科幻剧《未来闪影》首播',
      '2011 年，主演动作电影《全面回忆》',
      '2013 年，其主演的科幻冒险电影《星际迷航：暗黑无界》上映',
      '2016 年，其主演的科幻冒险电影《星际迷航 3：超越星辰》上映',
      '2018 年，在悬疑电影《网络谜踪》中饰演男主角大卫 · 金'
    ],
    evaluation: [
      '约翰 · 赵拥有一副标准的东亚男人面孔和并不高大威猛的身材。他有着出色的演技，在戏剧及喜剧方面都有优秀的演出。在电影《全面回忆》中，约翰 · 赵的戏份虽然不多，但其酷似周杰伦的面孔和造型却给中国内地观众留下了深刻的印象。此外，在一组杂志写真中，约翰 · 赵身穿各式正装，不仅俊俏帅气，而且还凸显了其熟男的气质',
      '约翰 · 赵是一位风格多变的演技派，有着冷面笑匠的气质。在《美国派》、《丑女贝蒂》等影视作品中，约翰 · 赵饰演的角色大部分都是滑稽搞笑的，虽然是很小的角色，却都非常抢戏。而在电影《星舰迷航》中，则让人们看到了他喜剧面孔之外的另一面',
      '在电影《网络谜踪》中，约翰 · 赵一别过往观众所熟悉的喜剧、表情丰富的演出，其角色更黑暗严肃，营造出了少见的真实且精彩的表演。其中一幕，他接到一通电话后，腿软倒地不起，瑟缩在地上痛哭，虽然只有远景捕捉背影，观众也听不到电话另一头的对话，但是约翰 · 赵感染力十足的演出让人印象深刻，深刻表达出儿女下落不明对家长是如何大的心理打击，其精彩演出也证明了亚裔演员有能力胜任演绎非特定种族的角色'
    ]
  }
}
