/**
 * @file crew-data 相关 kelvin 文件
 * @description 开尔文时间线系列演员信息
 */

import IconChrisPine from './images/kelvin/icon-chris-pine.jpg'

import { DataType } from '.'

export const data: DataType = {
  ChrisPine: {
    icon: IconChrisPine,
    zhName: '克里斯 · 派恩',
    enName: [
      'Chris Pine'
    ],
    alias: [
      'Christopher Whitelaw Pine'
    ],
    nationality: '美国',
    national: '',
    birthPlace: '美国加利福尼亚州洛杉矶',
    birthDay: '1980 年 8 月 26 日',
    deathTime: '',
    constellation: '处女座',
    height: '183cm',
    graduateSchool: '加州大学伯克利分校',
    profession: [
      '演员'
    ],
    representativeWorks: [
      '《公主日记 2：皇室婚约》',
      '星际迷航开尔文时间线系列',
      '《危情时速》',
      '《赴汤蹈火》',
      '《神奇女侠》'
    ],
    mainAchievements: [
      '青少年选择奖第 19 届最佳动作电影男演员',
      '很可惜其他均为提名'
    ],
    hobby: [],
    information: [
      '克里斯 · 派恩（Chris Pine），1980 年 8 月 26 日出生于美国加利福尼亚州洛杉矶，美国影视演员，毕业于加州大学伯克利分校并获得英语文学学士学位',
      '克里斯 · 派恩的家人（父亲、母亲、外祖母、外祖父以及姐姐）都是从事演艺事业，因此他从小就立志当一名演员，他的父母当然是不遗余力地给予支持。派恩毕业于加州柏克莱大学，又到美国音乐学院以及英国利兹大学学习表演',
      '克里斯 · 派恩的演艺生涯开始于剧场表演。他在威廉姆斯的戏剧节（Williamstown Theater Festival），加利福尼亚大学和洛杉矶的剧团里担当过表演',
      '2003 年，他初登荧幕，客串《急诊室的故事》。2004 年，24 岁的克里斯 · 佩恩出演了《公主日记 2：皇室婚约》。2010 年，克里斯 · 派恩在《危情时速》中担任主演',
      '2009 年，克里斯 · 派恩因饰演《星际迷航》电影中的詹姆斯 · T · 柯克舰长一角走红。2013 年，克里斯 · 派恩主演的《星际迷航：暗黑无界》上映，并获得第 15 届青少年选择奖最佳夏日电影男星的提名',
      '2016 年，主演的《星际迷航：超越星辰》、《赴汤蹈火》上映。2017 年，主演的 DC 电影《神奇女侠》上映',
      '2017 年，确定与米歇尔 · 威廉姆斯合作出演惊悚片《All the Old Knives》',
      '2018 年 3 月 9 日，与奥普拉 · 温弗瑞、瑞茜 · 威瑟斯彭、敏迪 · 卡灵合作出演的奇幻电影《时间的皱折》在美国上映。2018 年 9 月 6 日，主演的历史电影《法外之王》在多伦多国际电影节上映，饰演苏格兰国王罗伯特 · 布鲁斯',
      '2019 年，与英迪娅 · 埃斯利合作出演的电视迷你剧《我即黑夜》播出',
      '2020 年，与盖尔 · 加朵合作出演的电影《神奇女侠 1984》在美国上映'
    ],
    evaluation: [
      '克里斯 · 派恩被称为为马特 · 达蒙和布拉德 · 皮特综合体的大男孩，从骨子里就散发着一股浓郁的美国派味儿',
      '克里斯饰演的詹姆斯 · T · 柯克舰长在《星际迷航》中算是一个大胆的尝试'
    ]
  }
}
